/**
 * @author liujintao
 */
define('farsi:fileManager', function(require, exports, module){
    var dictionary = {
        ImportFile: 'وارد کردن فایل‌ها',
        ImportDirectory: 'وارد کردن پوشه',
        sureDelete : "مطمئن هستید که فایل‌ها/پوشه‌های انتخابی حذف شوند؟",
        
        exportingTitle:"در حال صادر کردن، دستگاه را متصل نگهدارید",
        deletingTitle:"در حال حذف، دستگاه را متصل نگهدارید",
        /*2014-07-26*/
        copingTitle:"لطفاً دستگاه را متصل نگهدارید",
        copySuccess:"کپی کردن فایل‌ها موفق بود",
        sdCard:'کارت حافظه',
        extSdCard:'کارت حافظه خارجی',
        pasteLabel:"الصاق",
        newFolder:"پوشه جدید",
        /*2014-08-04*/
       selectMultiInfo:"{0} پوشه و {1} فایل انتخاب شد",
       selectDirectoryInfo:"{0} پوشه، {1} فایل ",
       sdCardUsage:"کل: {0}، در دسترس: {1}",
       sizeLabel:"اندازه: {0}",
       modifiedTime:"زمان اصلاح: {0}",
       /*2014-08-08*/
       importingTitle:'وارد کردن در حال انجام است، تلفن را متصل نگهدارید',
	   /*2014-08-11*/
       noSdCardNotice:'خواندن کارت حافظه ناموفق بود، لطفاً مطمئن شوید کارت حافظه در دستگاهتان وجود دارد.',
       confirmFileReplace:'{0} از قبل وجود دارد. مطمئن هستید که می‌خواهید آن را جایگزین کنید؟',
       /*2014-08-18*/
      deleteFailed:"حذف {0} فایل/پوشه موفق و حذف {1} ناموفق بود:",
       importFailed:"وارد کردن {0} فایل/پوشه موفق و وارد کردن {1} ناموفق بود:",
	   createFolderFailed:"ایجاد پوشه ناموفق بود",
       exportFailed:"صادر کردن {0} فایل/پوشه موفق و صادر کردن {1} ناموفق بود:",
       copyFailed:"کپی کردن {0} فایل/پوشه موفق و کپی کردن {1} ناموفق بود:",
       /*2014-08-21*/
      renameFailed:"تغییر نام ناموفق بود",
       spaceFailed:"فضا کافی نیست . فایل. ",
       nosdcontent:"این پوشه خالی است.",
       /*2014-09-11*/
       specailCharNotice:'نویسه‌های زیر در نام پوشه مجاز نیستند: |/\:*?"<>',//重命名
       renameRepeatNotice:'پوشه‌ای با نام [{0}] از قبل وجود دارد. لطفاً نام دیگری وارد کنید.',//重命名已存在
       renameLabel:"تغییر نام",
       openingTitle:'در حال باز کردن. لطفاً دستگاهتان را متصل نگهدارید', 
       fileExtChangeNotice:'چنانچه پسوند نام فایل را تغییر دهید، ممکن است فایل غیرقابل استفاده شود. مطمئن هستید که می‌خواهید آن را تغییر دهید؟',//后缀变更
       openHeader:"فایل باز شد",
       openingFailed:"فایل باز نشد",     
       /*2014-10-15*/
      cMemoryLess:"فضای کافی در درایو C وجود ندارد. لطفا قبل از باز کردن ویدیو، موسیقی و غیره، بخشی از فضا را خالی کنید."      
    };
    return dictionary;
});
