/**
 * @author liujintao
 */
define('arabic:fileManager', function(require, exports, module){
    var dictionary = {
        ImportFile: 'إستيراد ملفات',
        ImportDirectory: 'إستيراد مجلدات',
        sureDelete : "هل انت متاكد من مسح هذه الملفات والمجلدات ؟",
        
        exportingTitle:"جاري التصدير، برجاء بقاء الهاتف متصل",
        deletingTitle:"جاري الحذف، برجاء بقاء الهاتف متصل",
        /*2014-07-26*/
        copingTitle:"برجاء بقاء الهاتف متصل",
        copySuccess:"تم نسخ الملفات بنجاح",
        sdCard:'بطاقة التخزين',
        extSdCard:'بطاقة التخزين الخارجية',
        pasteLabel:"لصق",
        newFolder:"مجلد جديد",
        /*2014-08-04*/
       selectMultiInfo:"تم اختيار {0} مجلد و {1} ملف",
       selectDirectoryInfo:"{0} مجلد و {1} ملف",
       sdCardUsage:"المجموع: {0} ، المتاح: {1}",
       sizeLabel:"الحجم: {0}",
       modifiedTime:"آخر تعديل: {0}",
       /*2014-08-08*/
       importingTitle:'جاري الإستيراد، برجاء بقاء الهاتف متصل',
	   /*2014-08-11*/
       noSdCardNotice:'لقد تعذر العثور علي بطاقة التخزين، برجاء التاكد من وجود بطاقة تخزين في هاتفك',
       confirmFileReplace:'{0} موجود من قبل، هل انت متاكد من استبدالة?',
       /*2014-08-18*/
      deleteFailed:"تم حذف {0} ملف/مجلد بنجاح، كما تعذر حذف {1} ملف/مجلد",
       importFailed:"تم إستيراد {0} ملف/مجلد بنجاح، كما تعذر إستيراد {1} ملف/مجلد",
	   createFolderFailed:"تعذر انشاء مجلد جديد",
       exportFailed:"تم تصدير {0} ملف/مجلد بنجاح، كما تعذر تصدير {1} ملف/مجلد",
       copyFailed:"تم نسخ {0} ملف/مجلد بنجاح، كما تعذر نسخ {1} ملف/مجلد",
       /*2014-08-21*/
       renameFailed:"فشلت عملية أعادة التسمية",
       spaceFailed:"المساحة غير كافية . ملف.",
       nosdcontent:"هذا المجلد فارغ.",
       nosdcontent:"هذا المجلد فارغ.",
       /*2014-09-11*/
       specailCharNotice:'|/\:*?"<> الرموز الأتية غير مسموحة في تسمية المجلد:',//重命名
       renameRepeatNotice:'المجلد المسمى [{0}] موجود بالفعل. من فضلك ادخل أسم آخر للمجلد.',//重命名已存在
       renameLabel:"أعادة التسمية",
       openingTitle:' يفتح الآن. يرجى البقاء على اتصال جهازك', 
       fileExtChangeNotice:' إذا قمت بتغيير ملحق اسم الملف، قد يصبح الملف غير قابل للاستخدام. هل أنت متأكد أنك تريد تغييره؟',//后缀变更
       openHeader:"فتح الملف",
       openingFailed:"فشل في فتح الملف" ,
       /*2014-10-15*/
      cMemoryLess:"مساحة محرك الأقراص C لا يكفي، يرجى تنظيف محرك الأقراص C ثم فتح (الفيديو، والموسيقى، وغيرها)"      
    };
    return dictionary;
});
